tool/springboot-cli.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-05 Fri 15:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spring Boot 命令行 - 快速迭代 Java Web 项目</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">Spring Boot 命令行 - 快速迭代 Java Web 项目</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb81a179">1. Spring Boot</a>
<ul>
<li><a href="#orgba063fe">1.1. 下载和安装</a></li>
</ul>
</li>
<li><a href="#org3c89f46">2. Spring Boot 命令行</a>
<ul>
<li><a href="#org6d4de30">2.1. 新建项目 spring init</a></li>
<li><a href="#orga974105">2.2. 列出所有的依赖列表</a></li>
<li><a href="#orgac02439">2.3. 启动项目</a></li>
<li><a href="#org165edba">2.4. 项目打包和运行</a></li>
</ul>
</li>
<li><a href="#org123f454">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgb81a179" class="outline-2">
<h2 id="orgb81a179"><span class="section-number-2">1</span> Spring Boot</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://spring.io/projects/spring-boot">spring-boot-cli</a>（Spring Boot CLI）是一种快速开发 <a href="https://spring.io/projects/spring-boot">spring</a> 应用的命令行界面， CLI
利用了 Spring Boot 的起步依赖和自动配置，可以让人们专注于代码本身，而不用完成
繁琐的配置。实际上 Spring Boot 的本质就是用来简化繁琐的 Spring 配置，不过 CLI
的使用真的是让开发 Spring 程序变得非常快速。
</p>

<p>
CLI 可以检测到代码中使用的类，知道需要给 classpath 中添加的哪些起步依赖才能让
程序运行起来。而且当添加完依赖之后就会完成自动配置，确保启用后
DispatcherServlet 和 Spring MVC，这样就可以响应 HTTP 请求了。所以说想要用 CLI 来
编写一个 Spring 的“HelloWorld” 是非常快速的。
</p>
</div>

<div id="outline-container-orgba063fe" class="outline-3">
<h3 id="orgba063fe"><span class="section-number-3">1.1</span> 下载和安装</h3>
<div class="outline-text-3" id="text-1-1">
<p>
下载二进制文件，解压到软件目录，并将 bin 目录添加到 <b>PATH</b> 环境变量中
</p>
<div class="org-src-container">
<pre class="src src-sh">curl -O https://repo.spring.io/release/org/springframework/boot/spring-boot-cli/2.0.5.RELEASE/spring-boot-cli-2.0.5.RELEASE-bin.tar.gz
</pre>
</div>

<p>
也可以直接通过网页链接<a href="https://repo.spring.io/release/org/springframework/boot/spring-boot-cli">下载</a>，MacOS 可以还可以通过 Homebrow 来安装。
</p>
<div class="org-src-container">
<pre class="src src-sh">brew tap pivotal/tap
brew install springboot
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3c89f46" class="outline-2">
<h2 id="org3c89f46"><span class="section-number-2">2</span> Spring Boot 命令行</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6d4de30" class="outline-3">
<h3 id="org6d4de30"><span class="section-number-3">2.1</span> 新建项目 spring init</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Spring Boot 提供了一个基于 web 的新建项目工具 <a href="http://start.spring.io/">start-spring-io</a> 。当然，也可以
通过命令行工具来创建。
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26032;&#24314;&#39033;&#30446;</span>
spring init --dependencies=web springapp

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">&#26032;&#24314;&#39033;&#30446;&#65292;&#21516;&#26102;&#35774;&#32622; groupId &#21644; artifactId</span>
spring init --artifactId=demo --groupId=com.example --dependencies=web,jpa springapp
spring init -a skree -g com.avic.mti -d=web,data-jpa skree
</pre>
</div>
</div>
</div>

<div id="outline-container-orga974105" class="outline-3">
<h3 id="orga974105"><span class="section-number-3">2.2</span> 列出所有的依赖列表</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">spring init --list
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">OUTPUT:</span>
<span style="color: #93a1a1; font-style: italic;">#   </span><span style="color: #93a1a1; font-style: italic;">.   ____          _            __ _ _</span>
<span style="color: #93a1a1; font-style: italic;">#  </span><span style="color: #93a1a1; font-style: italic;">/\\ / ___'_ __ _ _(_)_ __  __ _ \ \ \ \</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">( ( )\___ | '_ | '_| | '_ \/ _` | \ \ \ \</span>
<span style="color: #93a1a1; font-style: italic;">#  </span><span style="color: #93a1a1; font-style: italic;">\\/  ___)| |_)| | | | | || (_| |  ) ) ) )</span>
<span style="color: #93a1a1; font-style: italic;">#   </span><span style="color: #93a1a1; font-style: italic;">'  |____| .__|_| |_|_| |_\__, | / / / /</span>
<span style="color: #93a1a1; font-style: italic;">#  </span><span style="color: #93a1a1; font-style: italic;">=========|_|==============|___/=/_/_/_/</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">:: Service capabilities ::  https://start.spring.io</span>
<span style="color: #93a1a1; font-style: italic;">#</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Supported dependencies</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">+---------------+------------------------------------------------------------------+------------------+</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">| Id            | Description                                                      | Required version |</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">|---------------+------------------------------------------------------------------+------------------|</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">| activemq      | Java Message Service API via Apache ActiveMQ                     | &gt;=1.4.0.RC1      |</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">...</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">| validation    | JSR-303 validation infrastructure (already included with web)    | &gt;=1.3.0.RELEASE  |</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">| web           | Full-stack web development with Tomcat and Spring MVC            |                  |</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">| web-services  | Contract-first SOAP service development with Spring Web Services |                  |</span>
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">+---------------+------------------------------------------------------------------+------------------+</span>
<span style="color: #93a1a1; font-style: italic;">#</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac02439" class="outline-3">
<h3 id="orgac02439"><span class="section-number-3">2.3</span> 启动项目</h3>
<div class="outline-text-3" id="text-2-3">
<p>
启动项目前先修改 DemoApplication.java 文件中，添加一个控制器。
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">src/main/java/com/example/springapp/DemoApplication.java</span>
<span style="color: #859900;">package</span> com.example.<span style="color: #268bd2;">springapp</span>;

<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">boot</span>.<span style="color: #268bd2;">SpringApplication</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">boot</span>.<span style="color: #268bd2;">autoconfigure</span>.<span style="color: #268bd2;">SpringBootApplication</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">web</span>.<span style="color: #268bd2;">bind</span>.<span style="color: #268bd2;">annotation</span>.<span style="color: #268bd2;">RestController</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">web</span>.<span style="color: #268bd2;">bind</span>.<span style="color: #268bd2;">annotation</span>.<span style="color: #268bd2;">RequestMapping</span>;

<span style="color: #268bd2;">@SpringBootApplication</span>
<span style="color: #268bd2;">@RestController</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">DemoApplication</span> <span style="color: #8d5649;">{</span>

  <span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">main</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">String</span><span style="color: #9564bf;">[]</span> <span style="color: #6c71c4;">args</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    SpringApplication.run<span style="color: #9564bf;">(</span>DemoApplication.<span style="color: #859900;">class</span>, args<span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>

  <span style="color: #268bd2;">@RequestMapping</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">"/"</span><span style="color: #d8241f;">)</span>
  <span style="color: #859900;">public</span> <span style="color: #268bd2;">String</span> <span style="color: #b58900;">index</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
    <span style="color: #859900;">return</span> <span style="color: #2aa198;">"&lt;p&gt;Hello World!&lt;/p&gt;"</span>;
  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
使用 spring 自带的工具来运行代码
</p>
<div class="org-src-container">
<pre class="src src-sh">spring run src/main/java/com/example/springapp/DemoApplication.java
</pre>
</div>

<p>
使用 maven 工具启动 spring-boot 项目
</p>
<div class="org-src-container">
<pre class="src src-sh">mvn spring-boot:run
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">debug &#27169;&#24335;&#36816;&#34892;</span>
mvn spring-boot:run --debug
</pre>
</div>

<p>
在浏览器中打开 <code>http://localhost:8080</code> 链接应该可以访问到相应的页面。
</p>
</div>
</div>

<div id="outline-container-org165edba" class="outline-3">
<h3 id="org165edba"><span class="section-number-3">2.4</span> 项目打包和运行</h3>
<div class="outline-text-3" id="text-2-4">
<p>
这里可以使用 maven 默认的打包命令来生成 jar 包，运行可运行的 jar 文件。
</p>
<div class="org-src-container">
<pre class="src src-sh">mvn package
java -jar target/springapp-0.0.1-SNAPSHOT.jar
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org123f454" class="outline-2">
<h2 id="org123f454"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://docs.spring.io/spring-boot/docs/current/reference/html/cli-using-the-cli.html">Using Spring Boot CLI</a></li>
<li><a href="https://spring.io/projects/spring-boot">Spring Boot Project Homepage</a></li>
<li><a href="https://spring.io/guides/gs/rest-service/">RESTful Service</a></li>
<li><a href="https://spring.io/guides/gs/consuming-rest-angularjs/">Consuming a RESTful Web Service with AngularJS</a></li>
<li><a href="https://github.com/spring-guides/tut-rest.git">Spring Tutorial Github Repo</a></li>
<li><a href="https://www.imooc.com/learn/1058">Spring Boot 2.0 深度实践之系列总览</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-10 Wed 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-07-05 Fri 15:41</p>
<p class="validation"></p>
</div>
</body>
</html>
